Repository: imcat-owo/dudu-native
Catalog: Dudu/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# voice.alarmConfirmDeleteTitle
source: Delete this alarm?
zh_hans: 删掉这个闹钟？
zh_hant: 刪掉這個鬧鐘？

# voice.alarmDelete
source: Delete
zh_hans: 删掉
zh_hant: 刪掉

# voice.alarmDeleteFail
source: Couldn't delete the alarm: %1$@
zh_hans: 闹钟没删掉：%1$@
zh_hant: 鬧鐘沒刪掉：%1$@

# voice.alarmDesc
source: Let the AI set alarms for you.
zh_hans: 让 AI 帮你定闹钟，到点准时叫你。
zh_hant: 讓 AI 幫你定鬧鐘，到點準時叫你。

# voice.alarmEdit
source: Edit time
zh_hans: 改时间
zh_hant: 改時間

# voice.alarmEditDate
source: Date
zh_hans: 日期
zh_hant: 日期

# voice.alarmEmpty
source: No alarms yet — ask the AI to set one.
zh_hans: 还没有闹钟，让 AI 帮你定一个吧。
zh_hant: 還沒有鬧鐘，讓 AI 幫你定一個吧。

# voice.alarmInvalidTime
source: Invalid time — use YYYY-MM-DD and HH:MM
zh_hans: 时间格式不对，用 YYYY-MM-DD 和 HH:MM
zh_hant: 時間格式不對，用 YYYY-MM-DD 和 HH:MM

# voice.alarmLabel
source: Label
zh_hans: 备注
zh_hant: 備註

# voice.alarmNeedPermission
source: Alarm permission is needed first.
zh_hans: 得先允许闹钟权限，不然到点叫不醒你。
zh_hant: 得先允許鬧鐘權限，不然到點叫不醒你。

# voice.alarmOff
source: Off
zh_hans: 已关闭
zh_hant: 已關閉

# voice.alarmOn
source: On
zh_hans: 开着
zh_hant: 開著

# voice.alarmSet
source: Set alarm
zh_hans: 定闹钟
zh_hant: 定鬧鐘

# voice.alarmSetFail
source: Couldn't set the alarm: %1$@
zh_hans: 闹钟没定上：%1$@
zh_hant: 鬧鐘沒定上：%1$@

# voice.alarmSetOk
source: Alarm set. I'll wake you up on time.
zh_hans: 闹钟定好了，到点叫你。
zh_hant: 鬧鐘定好了，到點叫你。

# voice.alarmSetOkNotif
source: Reminder set as a notification (not a system alarm) — I'll notify you on time.
zh_hans: 已设为通知提醒（非系统闹钟），到点会推送提醒你。
zh_hant: 已設為通知提醒（非系統鬧鐘），到點會推送提醒你。

# voice.alarmTime
source: Time
zh_hans: 时间
zh_hant: 時間

# voice.alarmTitle
source: Alarms
zh_hans: 闹钟
zh_hant: 鬧鐘

# voice.alarmViaNotification
source: Notification
zh_hans: 通知提醒
zh_hant: 通知提醒

# voice.alarmViaSystem
source: System alarm
zh_hans: 系统闹钟
zh_hant: 系統鬧鐘

# voice.autoRead
source: Auto-read AI replies
zh_hans: 自动朗读 AI 回复
zh_hant: 自動朗讀 AI 回覆

# voice.autoReadDesc
source: When on, AI replies are read aloud automatically. Handy when driving or doing chores.
zh_hans: 打开后，AI 回完话会自动念出来。开车或者做家务的时候听，不用动手点。
zh_hant: 打開後，AI 回完話會自動念出來。開車或者做家務的時候聽，不用動手點。

# voice.autoReadUnavailable
source: Auto-read only works in local mode — unavailable in cloud mode or incognito.
zh_hans: 自动朗读只在本地模式下生效，云模式或无痕时暂不可用。
zh_hant: 自動朗讀只在本機模式下生效，雲端模式或無痕時暫不可用。

# voice.cache.clean
source: Clear cache
zh_hans: 清理缓存
zh_hant: 清理緩存

# voice.cache.cleaned
source: Cleared %1$@ files, freed %2$@.
zh_hans: 清掉了 %1$@ 个文件，腾出 %2$@。
zh_hant: 清掉了 %1$@ 個文件，騰出 %2$@。

# voice.cache.desc
source: Synthesized speech and podcasts pile up here. Anything untouched for 30 days gets quietly swept on launch — or clean it now.
zh_hans: 合成过的语音和播客会留在这里占地方。30 天没碰过的，开 App 时我会悄悄清掉；你也可以现在动手清。
zh_hant: 合成過的語音和播客會留在這裏佔地方。30 天沒碰過的，開 App 時我會悄悄清掉；你也可以現在動手清。

# voice.cache.failed
source: Couldn't clean up. Try again later.
zh_hans: 清理失败，稍后再试。
zh_hant: 清理失敗，稍後再試。

# voice.cache.nothing
source: Already clean — nothing to clear.
zh_hans: 已经很干净了，没什么可清的。
zh_hant: 已經很乾淨了，沒什麼可清的。

# voice.cache.title
source: Voice cache
zh_hans: 语音缓存
zh_hant: 語音緩存

# voice.correctionClear
source: Clear learned corrections
zh_hans: 清空学习记录
zh_hant: 清空學習記錄

# voice.correctionDesc
source: Corrections you make to transcriptions are remembered and auto-applied next time.
zh_hans: 你改过的转写，嘟嘟会记住，下次同样听错的地方自动改过来。
zh_hant: 你改過的轉寫，嘟嘟會記住，下次同樣聽錯的地方自動改過來。

# voice.correctionEmpty
source: No corrections learned yet.
zh_hans: 还没有学到纠错，改一次转写结果就记住了。
zh_hant: 還沒有學到糾錯，改一次轉寫結果就記住了。

# voice.correctionTitle
source: Voice correction learning
zh_hans: 语音纠错学习
zh_hant: 語音糾錯學習

# voice.emotion.calm
source: Calm
zh_hans: 平静
zh_hant: 平靜

# voice.emotion.excited
source: Excited
zh_hans: 兴奋
zh_hant: 興奮

# voice.emotion.gentle
source: Gentle
zh_hans: 温柔
zh_hant: 溫柔

# voice.emotion.happy
source: Happy
zh_hans: 开心
zh_hant: 開心

# voice.emotion.playful
source: Playful
zh_hans: 调皮
zh_hant: 調皮

# voice.emotion.sad
source: Down
zh_hans: 低落
zh_hant: 低落

# voice.emotion.serious
source: Serious
zh_hans: 认真
zh_hant: 認真

# voice.emotionAuto
source: Auto (follow the words)
zh_hans: 自动（跟着内容走）
zh_hant: 自動（跟著內容走）

# voice.emotionPinDesc
source: Lock one tone for everything, or leave it on Auto and let the tone follow the words.
zh_hans: 锁死一种语气，或者保持自动，让语气跟着内容走。
zh_hant: 鎖死一種語氣，或者保持自動，讓語氣跟著內容走。

# voice.emotionTts
source: Emotional voice
zh_hans: 情绪化语音
zh_hant: 情緒化語音

# voice.emotionTtsDesc
source: When on, his voice follows the feeling of what he's saying — quicker when happy, slower and lower when sad. Only the default voice and some providers can do this; trust your ears.
zh_hans: 打开后，他说话的语气会跟着内容走：开心快一点，难过慢一点、沉一点。只有默认语音和部分服务商吃这套，效果以你听到的为准。
zh_hant: 打開後，他說話的語氣會跟著內容走：開心快一點，難過慢一點、沉一點。只有預設語音和部分服務商吃這套，效果以你聽到的為準。

# voice.micMode
source: Mic button
zh_hans: 麦克风按钮
zh_hant: 麥克風按鈕

# voice.micTranscribe
source: Speech to text
zh_hans: 语音转文字
zh_hant: 語音轉文字

# voice.micTranscribeDesc
source: Record, transcribe into the input, edit before sending
zh_hans: 录完转成文字填进输入框，可改完再发
zh_hant: 錄完轉成文字填進輸入框，可改完再發

# voice.micVoiceMessage
source: Send voice message
zh_hans: 发送语音消息
zh_hant: 發送語音消息

# voice.micVoiceMessageDesc
source: Record and send as a voice bubble
zh_hans: 录完直接发语音气泡
zh_hant: 錄完直接發語音氣泡

# voice.msgA11yHoldToTalk
source: Hold to talk
zh_hans: 按住说话
zh_hant: 按住說話

# voice.msgA11yReleaseCancel
source: Release to cancel the voice message
zh_hans: 松开取消语音
zh_hant: 鬆開取消語音

# voice.msgA11yReleaseSend
source: Release to send the voice message
zh_hans: 松开发送语音
zh_hant: 鬆開發送語音

# voice.msgNeedMic
source: Microphone permission is needed to record
zh_hans: 需要麦克风权限才能录音
zh_hant: 需要麥克風權限才能錄音

# voice.msgPause
source: Pause voice message
zh_hans: 暂停语音
zh_hant: 暫停語音

# voice.msgPlay
source: Play voice message
zh_hans: 播放语音
zh_hant: 播放語音

# voice.msgPlayFailed
source: Couldn't play the audio.
zh_hans: 无法播放音频。
zh_hant: 無法播放音頻。

# voice.msgReleaseCancel
source: Release to cancel
zh_hans: 松开取消
zh_hant: 鬆開取消

# voice.msgReleaseSend
source: Release to send · slide up to cancel
zh_hans: 松开发送 · 上滑取消
zh_hant: 鬆開發送 · 上滑取消

# voice.msgSaveFailed
source: Couldn't save the recording
zh_hans: 录音保存失败
zh_hant: 錄音保存失敗

# voice.msgStartFailed
source: Couldn't start recording
zh_hans: 录音启动失败
zh_hant: 錄音啓動失敗

# voice.msgTooShort
source: Recording too short
zh_hans: 录音太短
zh_hant: 錄音太短

# voice.podcast.defaultTitle
source: Podcast
zh_hans: 播客
zh_hant: 播客

# voice.podcast.failed
source: Synthesis failed
zh_hans: 合成失败
zh_hant: 合成失敗

# voice.podcast.stage
source: Synthesizing %1$@/%2$@
zh_hans: 正在合成 %1$@/%2$@ 段
zh_hant: 正在合成 %1$@/%2$@ 段

# voice.saveFailed
source: Couldn't save — your change wasn't stored. Please try again.
zh_hans: 保存失败，设置没有存上，请再试一次
zh_hant: 保存失敗，設置沒有存上，請再試一次

# voice.speak
source: Read aloud
zh_hans: 朗读
zh_hant: 朗讀

# voice.speakFailed
source: Read-aloud failed: %1$@. Tap to retry.
zh_hans: 朗读失败：%1$@，点按重试
zh_hant: 朗讀失敗：%1$@，點按重試

# voice.stopSpeak
source: Stop
zh_hans: 停止朗读
zh_hant: 停止朗讀

# voice.sttCustom
source: Dedicated transcription service
zh_hans: 专用转写服务
zh_hant: 專用轉寫服務

# voice.sttDashscope
source: Alibaba Bailian
zh_hans: 阿里百炼
zh_hant: 阿里百鍊

# voice.sttGroup
source: Use the active group's transcription endpoint
zh_hans: 用当前分组的转写接口
zh_hant: 用當前分組的轉寫接口

# voice.sttKeyRequired
source: Fill in the API key to use this transcription service
zh_hans: 填一下 Key 才能用这个转写服务
zh_hant: 填一下 Key 才能用這個轉寫服務

# voice.sttModel
source: Model
zh_hans: 模型
zh_hant: 模型

# voice.sttModelRequired
source: Please enter the model
zh_hans: 请填写模型
zh_hant: 請填寫模型

# voice.sttPreset
source: Transcription service
zh_hans: 转写服务
zh_hant: 轉寫服務

# voice.sttPresetModel
source: Model
zh_hans: 模型
zh_hant: 模型

# voice.sttPresetUrl
source: Endpoint URL
zh_hans: 接口地址
zh_hant: 接口地址

# voice.sttTest
source: Test transcription
zh_hans: 测试转写
zh_hant: 測試轉寫

# voice.sttTestDesc
source: Record a short clip to check transcription quality.
zh_hans: 录一段话，看看转写效果和准不准。
zh_hant: 錄一段話，看看轉寫效果和準不準。

# voice.sttTestNoAudio
source: No audio captured, try again
zh_hans: 没有录到音频，再试一次
zh_hant: 沒有錄到音頻，再試一次

# voice.sttTestNoMic
source: Microphone permission is required to test
zh_hans: 需要麦克风权限才能测试
zh_hant: 需要麥克風權限才能測試

# voice.sttTestRecording
source: Recording…%1$@s (auto-stops at 10s)
zh_hans: 正在录音…%1$@秒（10秒自动结束）
zh_hant: 正在錄音…%1$@秒（10秒自動結束）

# voice.sttTestResult
source: Result
zh_hans: 转写结果
zh_hant: 轉寫結果

# voice.sttTestStart
source: Start recording
zh_hans: 开始录音
zh_hant: 開始錄音

# voice.sttTestStop
source: Stop & transcribe
zh_hans: 停止并转写
zh_hant: 停止並轉寫

# voice.sttTestTranscribing
source: Transcribing…
zh_hans: 转写中…
zh_hant: 轉寫中…

# voice.sttTitle
source: Speech-to-text (STT)
zh_hans: 语音转写（STT）
zh_hant: 語音轉寫（STT）

# voice.sttUrl
source: Endpoint URL
zh_hans: 接口地址
zh_hant: 接口地址

# voice.sttUrlInvalid
source: Invalid API URL (must start with http:// or https://)
zh_hans: 接口地址格式不正确（需以 http:// 或 https:// 开头）
zh_hant: 接口地址格式不正確（需以 http:// 或 https:// 開頭）

# voice.sttUrlRequired
source: Please enter the API URL
zh_hans: 请填写接口地址
zh_hant: 請填寫接口地址

# voice.synthesizing
source: Synthesizing…
zh_hans: 合成中…
zh_hant: 合成中…

# voice.test
source: Preview
zh_hans: 试听
zh_hant: 試聽

# voice.testFail
source: Preview failed: %1$@
zh_hans: 试听失败：%1$@
zh_hant: 試聽失敗：%1$@

# voice.testOk
source: Playing the preview — if you can hear it, this voice works.
zh_hans: 正在播放试听——能听见，就说明这个声音没问题。
zh_hant: 正在播放試聽——能聽見，就說明這個聲音沒問題。

# voice.testText
source: Hey, it is Dudu.
zh_hans: 你好呀，我是嘟嘟。
zh_hant: 你好呀，我是嘟嘟。

# voice.testing
source: Synthesizing…
zh_hans: 合成中…
zh_hant: 合成中…

# voice.title
source: Voice
zh_hans: 语音
zh_hant: 語音

# voice.transcribing
source: Transcribing…
zh_hans: 转写中…
zh_hant: 轉寫中…

# voice.ttsCustom
source: Custom
zh_hans: 自定义
zh_hant: 自定義

# voice.ttsEdge
source: edge-tts (free, no key needed)
zh_hans: edge-tts（免费，无需 Key）
zh_hant: edge-tts（免費，無需 Key）

# voice.ttsKeyRequired
source: Fill in the API key to use this voice service
zh_hans: 填一下 Key 才能用这个语音服务
zh_hant: 填一下 Key 才能用這個語音服務

# voice.ttsModel
source: Model
zh_hans: 模型
zh_hant: 模型

# voice.ttsModelRequired
source: Please enter the model
zh_hans: 请填写模型
zh_hant: 請填寫模型

# voice.ttsProvider
source: Service
zh_hans: 服务
zh_hant: 服務

# voice.ttsProviderModel
source: Model (optional, uses default)
zh_hans: 模型（可空，用默认）
zh_hant: 模型（可空，用默認）

# voice.ttsProviderModelDefault
source: Default %1$@
zh_hans: 默认 %1$@
zh_hant: 默認 %1$@

# voice.ttsProviderUrl
source: Base URL (optional, uses default)
zh_hans: 接口地址（可空，用默认）
zh_hant: 接口地址（可空，用默認）

# voice.ttsProviderUrlDefault
source: Default %1$@
zh_hans: 默认 %1$@
zh_hant: 默認 %1$@

# voice.ttsQwen
source: Qwen
zh_hans: 通义千问
zh_hant: 通義千問

# voice.ttsSpeed
source: Speed
zh_hans: 语速
zh_hant: 語速

# voice.ttsTitle
source: Speech synthesis (TTS)
zh_hans: 语音合成（TTS）
zh_hant: 語音合成（TTS）

# voice.ttsUrl
source: Endpoint URL
zh_hans: 接口地址
zh_hant: 接口地址

# voice.ttsUrlInvalid
source: Invalid API URL (must start with http:// or https://)
zh_hans: 接口地址格式不正确（需以 http:// 或 https:// 开头）
zh_hant: 接口地址格式不正確（需以 http:// 或 https:// 開頭）

# voice.ttsUrlRequired
source: Please enter the API URL
zh_hans: 请填写接口地址
zh_hant: 請填寫接口地址

# voice.ttsVoice
source: Voice
zh_hans: 音色
zh_hant: 音色

# voice.ttsVoiceHint
source: Voice ID, check the provider docs
zh_hans: 音色 ID，看服务商文档填
zh_hant: 音色 ID，看服務商文檔填

# voice.voiceRequired
source: Please choose a voice
zh_hans: 请选择音色
zh_hant: 請選擇音色

# voicecall.close
source: Close
zh_hans: 关闭
zh_hant: 關閉

# voicecall.end
source: End call
zh_hans: 挂断
zh_hant: 掛斷

# voicecall.error.micDenied
source: The call needs microphone access — allow it in Settings to talk.
zh_hans: 通话需要麦克风权限——去设置里打开才能说话。
zh_hant: 通話需要麥克風權限——去設定裡打開才能說話。

# voicecall.error.noGroup
source: The call needs an API group — set one up in Connections first.
zh_hans: 通话需要先配好 API 分组——先去「连接」里设置。
zh_hant: 通話需要先配好 API 分組——先去「連接」裡設定。

# voicecall.manual.title
source: Voice call
zh_hans: 语音通话
zh_hant: 語音通話

# voicecall.mute
source: Mute
zh_hans: 静音
zh_hant: 靜音

# voicecall.ring.accept
source: Answer
zh_hans: 接听
zh_hant: 接聽

# voicecall.ring.decline
source: Decline
zh_hans: 挂断
zh_hant: 掛斷

# voicecall.ring.missed
source: Missed call
zh_hans: 未接来电
zh_hant: 未接來電

# voicecall.ring.title
source: Incoming call
zh_hans: 来电
zh_hant: 來電

# voicecall.status.capturing
source: Hearing you…
zh_hans: 听到你了…
zh_hant: 聽到你了…

# voicecall.status.connecting
source: Connecting…
zh_hans: 接通中…
zh_hant: 接通中…

# voicecall.status.listening
source: Listening…
zh_hans: 在听…
zh_hant: 在聽…

# voicecall.status.speaking
source: Speaking… (talk to interrupt)
zh_hans: 说话中…（直接开口就能打断我）
zh_hant: 說話中…（直接開口就能打斷我）

# voicecall.status.thinking
source: Thinking…
zh_hans: 想一下…
zh_hant: 想一下…

# voicecall.transcript.empty
source: Talk — I'm listening.
zh_hans: 说话吧，我在听。
zh_hant: 說話吧，我在聽。

# web.consoleTitle
source: Remote browser session console
zh_hans: 远程浏览器会话控制台
zh_hant: 遠程瀏覽器會話控制檯

# web.pdfTitle
source: PDF document reader
zh_hans: PDF 文档阅读器
zh_hant: PDF 文檔閱讀器

# webapps.create
source: New
zh_hans: 新建
zh_hant: 新建

# webapps.delete
source: Delete
zh_hans: 删除
zh_hant: 刪除

# webapps.deleteConfirm
source: Delete "%1$@"?
zh_hans: 删掉「%1$@」吗？
zh_hant: 刪掉「%1$@」嗎？

# webapps.edit
source: Edit
zh_hans: 编辑
zh_hant: 編輯

# webapps.empty
source: No web apps yet
zh_hans: 还没有网页应用
zh_hant: 還沒有網頁應用

# webapps.error.nameRequired
source: Give it a name
zh_hans: 起个名字
zh_hant: 起個名字

# webapps.error.urlInvalid
source: Bad URL — check it
zh_hans: 网址不对，检查一下
zh_hant: 網址不對，檢查一下

# webapps.hint
source: Pin favorite pages here — they open as clean fullscreen pages
zh_hans: 把常用网页钉在这里，点开就是干净的全屏页面
zh_hant: 把常用網頁釘在這裏，點開就是乾淨的全屏頁面

# webapps.name
source: Name
zh_hans: 名字
zh_hant: 名字

# webapps.namePlaceholder
source: e.g. Xiaohongshu
zh_hans: 比如：小红书
zh_hant: 比如：小紅書

# webapps.title
source: Web apps
zh_hans: 网页应用
zh_hant: 網頁應用

# webapps.url
source: URL
zh_hans: 网址
zh_hant: 網址

# worldbook.create
source: New world book
zh_hans: 新建世界书
zh_hant: 新建世界書

# worldbook.delete
source: Delete world book
zh_hans: 删除世界书
zh_hant: 刪除世界書

# worldbook.deleteConfirm
source: Delete "%1$@"?
zh_hans: 确定删除「%1$@」吗？
zh_hant: 確定刪除「%1$@」嗎？

# worldbook.description
source: Description
zh_hans: 简介
zh_hant: 簡介

# worldbook.edit
source: Edit world book
zh_hans: 编辑世界书
zh_hant: 編輯世界書

# worldbook.enabled
source: Enabled
zh_hans: 启用
zh_hant: 啓用

# worldbook.entries
source: Entries
zh_hans: 条目
zh_hant: 條目

# worldbook.entry.caseSensitive
source: Case-sensitive
zh_hans: 区分大小写
zh_hant: 區分大小寫

# worldbook.entry.constantActive
source: Always on
zh_hans: 常驻
zh_hant: 常駐

# worldbook.entry.constantActiveHint
source: Inject every time, no trigger needed
zh_hans: 不用触发词，每次都注入
zh_hant: 不用觸發詞，每次都注入

# worldbook.entry.content
source: Content
zh_hans: 内容
zh_hant: 內容

# worldbook.entry.contentPlaceholder
source: Lore text injected when triggered…
zh_hans: 触发时注入给 AI 的设定文本…
zh_hant: 觸發時注入給 AI 的設定文本…

# worldbook.entry.create
source: New entry
zh_hans: 新建条目
zh_hant: 新建條目

# worldbook.entry.deleteConfirm
source: Delete this entry?
zh_hans: 删除这条吗？
zh_hant: 刪除這條嗎？

# worldbook.entry.keywords
source: Trigger words
zh_hans: 触发词
zh_hant: 觸發詞

# worldbook.entry.keywordsHint
source: When these appear in chat, this lore is fed to the AI
zh_hans: 聊天里出现这些词，这条设定就会塞给 AI
zh_hant: 聊天裏出現這些詞，這條設定就會塞給 AI

# worldbook.entry.keywordsPlaceholder
source: One per line — triggers when seen in chat
zh_hans: 一行一个，聊天里出现就触发
zh_hant: 一行一個，聊天裏出現就觸發

# worldbook.entry.name
source: Entry name
zh_hans: 条目名
zh_hant: 條目名

# worldbook.entry.namePlaceholder
source: e.g. Dragon lore
zh_hans: 比如：龙族设定
zh_hant: 比如：龍族設定

# worldbook.entry.position
source: Inject position
zh_hans: 注入位置
zh_hant: 注入位置

# worldbook.entry.position.afterSystem
source: After system prompt
zh_hans: 系统提示词之后
zh_hant: 系統提示詞之後

# worldbook.entry.position.beforeSystem
source: Before system prompt
zh_hans: 系统提示词之前
zh_hant: 系統提示詞之前

# worldbook.entry.priority
source: Priority
zh_hans: 优先级
zh_hant: 優先級

# worldbook.entry.priorityHint
source: Higher injects first
zh_hans: 数字越大越先注入
zh_hant: 數字越大越先注入

# worldbook.entry.scanDepth
source: Scan depth
zh_hans: 扫描深度
zh_hant: 掃描深度

# worldbook.entry.scanDepthHint
source: How many recent messages to scan
zh_hans: 往前看几条消息找触发词
zh_hant: 往前看幾條消息找觸發詞

# worldbook.entry.useRegex
source: Use regex
zh_hans: 用正则
zh_hant: 用正則

# worldbook.list
source: World books
zh_hans: 世界书列表
zh_hant: 世界書列表

# worldbook.name
source: Name
zh_hans: 名字
zh_hant: 名字

# worldbook.namePlaceholder
source: e.g. Fantasy setting
zh_hans: 比如：奇幻大陆设定
zh_hant: 比如：奇幻大陸設定

# worldbook.noBooks
source: No world books yet
zh_hans: 还没有世界书
zh_hant: 還沒有世界書

# worldbook.title
source: World books
zh_hans: 世界书
zh_hant: 世界書

# shareimport.qrFailed
source: Couldn't render the QR code.
zh_hans: 二维码生成失败。
zh_hant: 二維碼生成失敗。

# shareimport.scanEntry
source: Scan to import
zh_hans: 扫码导入
zh_hant: 掃碼導入

# shareimport.shareEntry
source: Share this config
zh_hans: 分享此配置
zh_hant: 分享此配置

# shareimport.copyText
source: Copy share text
zh_hans: 复制分享文本
zh_hant: 複製分享文字

# shareimport.copied
source: Copied
zh_hans: 已复制
zh_hant: 已複製

# shareimport.qrTooBig
source: Too long for a QR code — use Copy share text instead.
zh_hans: 配置太长，放不进二维码。用「复制分享文本」发给对方。
zh_hant: 配置太長，放不進二維碼。用「複製分享文字」發給對方。

# shareimport.poolTruncated
source: The sharer included a key pool of %1$@ keys; this build keeps one key per service, so only the main key was imported.
zh_hans: 对方分享了 %1$@ 个 key 的密钥池，原生版一个服务只存一个 key，只导入了主 key。
zh_hant: 對方分享了 %1$@ 個 key 的金鑰池，原生版一個服務只存一個 key，只導入了主 key。

# shareimport.headersDropped
source: Custom request headers aren't supported in this build and were skipped.
zh_hans: 自定义请求头原生版暂不支持，已略过。
zh_hant: 自定義請求頭原生版暫不支援，已略過。

# shareimport.bodyExtrasDropped
source: Extra request parameters aren't supported in this build and were skipped.
zh_hans: 附加请求参数原生版暂不支持，已略过。
zh_hant: 附加請求參數原生版暫不支援，已略過。

# shareimport.noKey
source: This share has no key — fill it in on the detail page after importing.
zh_hans: 这份分享没有带 key，导入后请在详情页填写。
zh_hant: 這份分享沒有帶 key，導入後請在詳情頁填寫。

# shareimport.noBaseURL
source: This share has no base URL — fill it in on the detail page after importing.
zh_hans: 这份分享没有带地址，导入后请在详情页填写。
zh_hant: 這份分享沒有帶地址，導入後請在詳情頁填寫。

# shareimport.oauthNote
source: OAuth logins can't move over a QR code — only the config shape is shared; the other side still has to log in.
zh_hans: OAuth 登录无法通过二维码转移：分享只带配置外形，对方仍需自己登录。
zh_hant: OAuth 登入無法透過二維碼轉移：分享只帶配置外形，對方仍需自己登入。

# shareimport.viewDetail
source: View details
zh_hans: 查看详情
zh_hant: 查看詳情

# orchestration.title
source: Model groups
zh_hans: 模型分组
zh_hant: 模型分組

# orchestration.subtitle
source: Group models for fallback or load balancing. The default groups below decide which models new chats use.
zh_hans: 把模型编成组，做故障切换或负载均衡。下面的默认分组决定新会话用哪些模型。
zh_hant: 把模型編成組，做故障切換或負載均衡。下面的預設分組決定新會話用哪些模型。

# orchestration.defaults
source: Default groups
zh_hans: 默认分组
zh_hant: 預設分組

# orchestration.primary
source: Primary group
zh_hans: 主分组
zh_hant: 主分組

# orchestration.sub
source: Secondary group
zh_hans: 副分组
zh_hant: 副分組

# orchestration.none
source: None
zh_hans: 无
zh_hant: 無

# orchestration.groups
source: Groups
zh_hans: 分组
zh_hant: 分組

# orchestration.newGroupName
source: New group
zh_hans: 新分组
zh_hant: 新分組

# orchestration.groupNamePh
source: Group name
zh_hans: 分组名称
zh_hant: 分組名稱

# orchestration.memberCount
source: %1$@ models
zh_hans: %1$@ 个模型
zh_hant: %1$@ 個模型

# orchestration.strategy
source: Routing
zh_hans: 路由策略
zh_hant: 路由策略

# orchestration.strategyFallback
source: Fallback
zh_hans: 故障切换
zh_hant: 故障切換

# orchestration.strategyFallbackDesc
source: Try members in order; move to the next one on failure.
zh_hans: 按顺序尝试，失败就换下一个。
zh_hant: 按順序嘗試，失敗就換下一個。

# orchestration.strategyLoadBalance
source: Load balance
zh_hans: 负载均衡
zh_hant: 負載均衡

# orchestration.strategyLoadBalanceDesc
source: Spread sessions across members deterministically.
zh_hans: 把会话确定性地分散到各成员。
zh_hant: 把會話確定性地分散到各成員。

# orchestration.fallbackMode
source: Fallback triggers
zh_hans: 切换时机
zh_hant: 切換時機

# orchestration.fallbackModeLimited
source: Errors only
zh_hans: 仅出错时
zh_hant: 僅出錯時

# orchestration.fallbackModeAlways
source: Any failure
zh_hans: 任何失败都切
zh_hant: 任何失敗都切

# orchestration.members
source: Members
zh_hans: 成员
zh_hant: 成員

# orchestration.addMember
source: Add model
zh_hans: 添加模型
zh_hant: 添加模型

# orchestration.noMembers
source: No models yet — add the first one.
zh_hans: 还没有模型，加一个。
zh_hant: 還沒有模型，加一個。

# orchestration.pickMember
source: Pick a model
zh_hans: 选择模型
zh_hant: 選擇模型

# orchestration.noCandidates
source: Every model is already in this group.
zh_hans: 所有模型都已经在这个分组里了。
zh_hant: 所有模型都已經在這個分組裡了。

# orchestration.removeMember
source: Remove
zh_hans: 移除
zh_hant: 移除

# orchestration.capabilityNote
source: Capabilities come from the provider catalog, not a live test. Live capability probing isn't available in this build.
zh_hans: 能力信息来自厂商目录，不是实测。实时能力探测这个版本还没有。
zh_hant: 能力資訊來自廠商目錄，不是實測。即時能力探測這個版本還沒有。

# orchestration.deleteGroupConfirm
source: Delete this group?
zh_hans: 删除这个分组？
zh_hant: 刪除這個分組？

# orchestration.deleteGroupMessage
source: “%1$@” will be deleted; chat bindings to it stop working.
zh_hans: 「%1$@」将被删除，聊天里对它的绑定会失效。
zh_hant: 「%1$@」將被刪除，聊天裡對它的綁定會失效。

# orchestration.unavailableSuffix
source: %1$@ unavailable
zh_hans: %1$@ 个不可用
zh_hant: %1$@ 個不可用

# orchestration.modalityImage
source: Image
zh_hans: 图片
zh_hant: 圖片

# orchestration.modalityAudio
source: Audio
zh_hans: 音频
zh_hant: 音頻

# orchestration.modalityVideo
source: Video
zh_hans: 视频
zh_hant: 影片

# orchestration.modalityTextOnly
source: Text only
zh_hans: 纯文本
zh_hant: 純文字

# orchestration.thinking
source: Thinking
zh_hans: 思考
zh_hant: 思考

# orchestration.thinkingYes
source: Yes
zh_hans: 支持
zh_hant: 支援

# orchestration.thinkingNo
source: No
zh_hans: 不支持
zh_hant: 不支援

# orchestration.thinkingUnknown
source: Unknown
zh_hans: 未知
zh_hant: 未知

# orchestration.context
source: Context %1$@
zh_hans: 上下文 %1$@
zh_hant: 上下文 %1$@

# orchestration.groupGone
source: This group no longer exists.
zh_hans: 这个分组已经删掉了。
zh_hant: 這個分組已經刪掉了。

# orchestration.reasonHidden
source: Hidden
zh_hans: 已隐藏
zh_hant: 已隱藏

# orchestration.reasonDisabled
source: Disabled
zh_hans: 已停用
zh_hant: 已停用

# orchestration.reasonNoCredential
source: Not logged in
zh_hans: 未登录
zh_hant: 未登入

# orchestration.reasonNoProvider
source: Provider gone
zh_hans: 服务不存在
zh_hant: 服務不存在

# sandbox.testConnection
source: Test connection
zh_hans: 测试连接
zh_hant: 測試連接

# sandbox.testConnectionNote
source: The test opens a real SSH session through the relay with the credentials above — nothing is saved.
zh_hans: 测试会用上面填的账号信息，经传话员真的打开一次 SSH 会话——什么都不会保存。
zh_hant: 測試會用上面填的帳號資訊，經傳話員真的打開一次 SSH 會話——什麼都不會保存。

# sandbox.testOk
source: Connection works — the relay opened a real SSH session.
zh_hans: 连接成功——传话员真的打开了一次 SSH 会话。
zh_hant: 連接成功——傳話員真的打開了一次 SSH 會話。

# sandbox.testFailed
source: Connection failed
zh_hans: 连接失败
zh_hant: 連接失敗

# crossapp.title
source: Open in other apps
zh_hans: 在其他 App 里打开
zh_hant: 在其他 App 裡打開

# crossapp.note
source: Opens the app through its URL scheme — the same mechanism as the AI's apple-open. Dudu can't see what happens inside the other app.
zh_hans: 通过 URL Scheme 打开对应 App——跟 AI 用的 apple-open 是同一套机制。嘟嘟看不到别的 App 里发生了什么。
zh_hant: 透過 URL Scheme 打開對應 App——跟 AI 用的 apple-open 是同一套機制。嘟嘟看不到別的 App 裡發生了什麼。

# crossapp.open
source: Open
zh_hans: 打开
zh_hant: 打開

# crossapp.inApp
source: Opens inside Dudu
zh_hans: 在嘟嘟内打开
zh_hant: 在嘟嘟內打開

source: Siri & Shortcuts
zh_hans: Siri 与捷径
zh_hant: Siri 與捷徑

source: Dudu lives in the Shortcuts app too. Seven voice shortcuts work out of the box — just say the phrase and Dudu gets moving.
zh_hans: 嘟嘟也住在捷径 App 里。七个语音捷径开箱即用——喊出口令，嘟嘟就开工。
zh_hant: 嘟嘟也住在捷徑 App 裡。七個語音捷徑開箱即用——喊出口令，嘟嘟就開工。

source: Apple doesn't let apps record their own Siri phrases, so Add to Siri opens the Shortcuts app — give any action a phrase of your own there.
zh_hans: 苹果不允许 App 自己录制 Siri 口令，所以「添加到 Siri」会打开捷径 App——在那里给任何动作起一个自己的口令。
zh_hant: 蘋果不允許 App 自己錄製 Siri 口令，所以「加入到 Siri」會打開捷徑 App——在那裡給任何動作起一個自己的口令。

source: Siri phrases
zh_hans: Siri 口令
zh_hant: Siri 口令

source: Try saying
zh_hans: 试试喊
zh_hant: 試試喊

source: All actions
zh_hans: 全部动作
zh_hant: 全部動作
